## Plan Result (prod-prod)




<pre><code>Plan: 258 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-ext-01.ext.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-ext-02.ext.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-ext-stg-01.ext.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-ext-stg-02.ext.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-ext-stg.sftp&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-ext.sftp&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-in-stg.int.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-int-01.int.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-int-02.int.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-int-stg-01.int.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-int-stg-02.int.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;bais-int.int.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;baisweb-stg.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;baisweb.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;cgi-aramismis&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;cgi-aramismis-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;cgi-dss&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;cgi-dss-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;cgi-libra-igs&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;cgi-libra-igs-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;cgi-sups-batch1&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;cgi-sups-batch1-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;cpp-ft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;cpp-ft-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;eckoh-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;erupload.ext.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;eruploadstg.ext.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;eucs-fap&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;eucs-fap-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;eucs-mailgw-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;eucs-mailgw01&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;eucs-mailgw02&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;eucs-staging&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;eucs-staging-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;gbgroup-juror-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;indesser-ageddebt&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;indesser-ageddebt-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;laa-xhb-pri&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;laa-xhb-pri-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;laa-xhb-sec&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;laa-xhb-sec-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;liberata-mo-pri&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;liberata-mo-pri-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;liberata-mo-sec&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;liberata-mo-sec-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;libra-atcm&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;libra-atcm-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;noag-oud-vm01&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;noag-web-vm01&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;noag-web-vm02&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;poag-oud-vm01&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;poag-web-vm01&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;poag-web-vm02&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;sscl-sop&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;sscl-sop-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;sscs-gaps2&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;sscs-gaps2-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;www.baisweb-stg.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;www.baisweb.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;www.erupload.ext.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;www.eruploadstg.ext.mft&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xerox-bp-pri&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xerox-bp-pri-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xerox-bp-sec&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xerox-bp-sec-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-amersham&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-amersham-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-aylesbury&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-aylesbury-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-basildon&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-basildon-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-birminghamann&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-birminghamann-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-birminghamcrown&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-birminghamcrown-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-blackfriars&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-blackfriars-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-bolton&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-bolton-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-bournemouth&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-bournemouth-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-bradford&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-bradford-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-brighton&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-brighton-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-bristol&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-bristol-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-burnley&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-burnley-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-caernarfon&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-caernarfon-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-cambridge&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-cambridge-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-canterbury&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-canterbury-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-cardiff&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-cardiff-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-carlisle&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-carlisle-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-chelmsford&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-chelmsford-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-chelmsfordmags&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-chelmsfordmags-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-chester&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-chester-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-coventry&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-coventry-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-croydon&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-croydon-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-croydonmags&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-croydonmags-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-derby&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-derby-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-doncaster&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-doncaster-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-durham&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-durham-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-exeter&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-exeter-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-gloucester&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-gloucester-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-greatgrimsby&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-greatgrimsby-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-guildford&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-guildford-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-guildfordmags&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-guildfordmags-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-harrow&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-harrow-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-hereford&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-hereford-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-hove&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-hove-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-huntingdon&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-huntingdon-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-innerlondon&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-innerlondon-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-ipswich&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-ipswich-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-isleworth&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-isleworth-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-kingslynn&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-kingslynn-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-kingston-upon-hull&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-kingston-upon-hull-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-kingstoncombined&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-kingstoncombined-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-kingstoncrown&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-kingstoncrown-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-lancaster&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-lancaster-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-leeds&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-leeds-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-leicester&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-leicester-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-lewes&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-lewes-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-lincoln&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-lincoln-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-liverpool&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-liverpool-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-luton&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-luton-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-maidstone&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-maidstone-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-manchestercrown&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-manchestercrown-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-manchesterminshull&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-manchesterminshull-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-merthyr&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-merthyr-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-mold&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-mold-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-newcastle&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-newcastle-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-newcastle-upon-tyne&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-newcastle-upon-tyne-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-newportcombined&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-newportcombined-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-newportcrown&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-newportcrown-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-northampton&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-northampton-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-norwich&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-norwich-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-nottingham&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-nottingham-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-oldbailey&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-oldbailey-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-oxford&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-oxford-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-peterborough&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-peterborough-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-peterboroughmags&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-peterboroughmags-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-plymouth&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-plymouth-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-portsmouth&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-portsmouth-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-prestonringway&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-prestonringway-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-prestonsessionshse&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-prestonsessionshse-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-reading&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-reading-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-readingmags&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-readingmags-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-salisbury&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-salisbury-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-sheffield&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-sheffield-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-shrewsbury&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-shrewsbury-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-snaresbrook&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-snaresbrook-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-southampton&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-southampton-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-southend&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-southend-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-southwark&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-southwark-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-stafford&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-stafford-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-stalbans&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-stalbans-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-stalbansmags&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-stalbansmags-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-stoke-on-trent&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-stoke-on-trent-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-swansea&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-swansea-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-swindon&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-swindon-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-taunton&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-taunton-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-teesside&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-teesside-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-truro&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-truro-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-warrington&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-warrington-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-warwick&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-warwick-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-winchester&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-winchester-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-wolverhamptoncombined&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-wolverhamptoncombined-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-wolverhamptonmags&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-wolverhamptonmags-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-woodgreen&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-woodgreen-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-woolwich&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-woolwich-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-worcester&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-worcester-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-york&#34;]
  * module.hmcts-net.azurerm_private_dns_a_record.this[&#34;xhb-pubd-york-stg&#34;]
  * module.hmcts-net.azurerm_private_dns_zone.zone[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-ext-01.ext.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-ext-01.ext.mft"
      + records             = [
          + "10.224.251.5",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-ext-02.ext.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-ext-02.ext.mft"
      + records             = [
          + "10.224.251.6",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-ext-stg-01.ext.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-ext-stg-01.ext.mft"
      + records             = [
          + "10.225.251.5",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-ext-stg-02.ext.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-ext-stg-02.ext.mft"
      + records             = [
          + "10.225.251.6",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-ext-stg.sftp"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-ext-stg.sftp"
      + records             = [
          + "10.225.251.4",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-ext.sftp"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-ext.sftp"
      + records             = [
          + "10.224.251.4",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-in-stg.int.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-in-stg.int.mft"
      + records             = [
          + "10.225.251.134",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-int-01.int.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-int-01.int.mft"
      + records             = [
          + "10.224.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-int-02.int.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-int-02.int.mft"
      + records             = [
          + "10.224.251.136",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-int-stg-01.int.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-int-stg-01.int.mft"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-int-stg-02.int.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-int-stg-02.int.mft"
      + records             = [
          + "10.225.251.136",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["bais-int.int.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bais-int.int.mft"
      + records             = [
          + "10.224.251.134",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["baisweb-stg.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "baisweb-stg.mft"
      + records             = [
          + "10.225.251.7",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["baisweb.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "baisweb.mft"
      + records             = [
          + "10.224.251.7",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["cgi-aramismis"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cgi-aramismis"
      + records             = [
          + "10.100.198.114",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["cgi-aramismis-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cgi-aramismis-stg"
      + records             = [
          + "10.72.0.113",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["cgi-dss"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cgi-dss"
      + records             = [
          + "10.100.198.11",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["cgi-dss-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cgi-dss-stg"
      + records             = [
          + "10.72.3.4",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["cgi-libra-igs"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cgi-libra-igs"
      + records             = [
          + "10.100.196.196",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["cgi-libra-igs-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cgi-libra-igs-stg"
      + records             = [
          + "10.72.2.231",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["cgi-sups-batch1"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cgi-sups-batch1"
      + records             = [
          + "10.100.196.183",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["cgi-sups-batch1-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cgi-sups-batch1-stg"
      + records             = [
          + "10.72.0.51",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["cpp-ft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cpp-ft"
      + records             = [
          + "10.24.0.138",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["cpp-ft-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cpp-ft-stg"
      + records             = [
          + "10.25.255.69",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["eckoh-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "eckoh-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["erupload.ext.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "erupload.ext.mft"
      + records             = [
          + "10.224.251.7",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["eruploadstg.ext.mft"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "eruploadstg.ext.mft"
      + records             = [
          + "10.225.251.7",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["eucs-fap"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "eucs-fap"
      + records             = [
          + "10.100.96.108",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["eucs-fap-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "eucs-fap-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["eucs-mailgw-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "eucs-mailgw-stg"
      + records             = [
          + "10.182.71.154",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["eucs-mailgw01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "eucs-mailgw01"
      + records             = [
          + "10.171.71.154",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["eucs-mailgw02"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "eucs-mailgw02"
      + records             = [
          + "10.172.71.154",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["eucs-staging"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "eucs-staging"
      + records             = [
          + "10.100.67.31",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["eucs-staging-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "eucs-staging-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["gbgroup-juror-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "gbgroup-juror-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["indesser-ageddebt"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "indesser-ageddebt"
      + records             = [
          + "195.40.87.32",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["indesser-ageddebt-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "indesser-ageddebt-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["laa-xhb-pri"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "laa-xhb-pri"
      + records             = [
          + "18.170.13.53",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["laa-xhb-pri-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "laa-xhb-pri-stg"
      + records             = [
          + "18.168.5.2",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["laa-xhb-sec"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "laa-xhb-sec"
      + records             = [
          + "157.203.40.154",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["laa-xhb-sec-st

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

   ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-southwark-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-southwark-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-stafford"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-stafford"
      + records             = [
          + "10.233.216.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-stafford-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-stafford-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-stalbans"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-stalbans"
      + records             = [
          + "10.1.95.247",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-stalbans-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-stalbans-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-stalbansmags"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-stalbansmags"
      + records             = [
          + "10.1.77.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-stalbansmags-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-stalbansmags-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-stoke-on-trent"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-stoke-on-trent"
      + records             = [
          + "10.2.62.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-stoke-on-trent-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-stoke-on-trent-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-swansea"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-swansea"
      + records             = [
          + "10.3.35.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-swansea-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-swansea-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-swindon"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-swindon"
      + records             = [
          + "10.234.74.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-swindon-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-swindon-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-taunton"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-taunton"
      + records             = [
          + "10.4.40.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-taunton-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-taunton-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-teesside"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-teesside"
      + records             = [
          + "10.6.41.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-teesside-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-teesside-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-truro"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-truro"
      + records             = [
          + "10.4.41.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-truro-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-truro-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-warrington"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-warrington"
      + records             = [
          + "10.3.39.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-warrington-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-warrington-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-warwick"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-warwick"
      + records             = [
          + "10.2.65.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-warwick-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-warwick-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-winchester"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-winchester"
      + records             = [
          + "10.4.43.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-winchester-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-winchester-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-wolverhamptoncombined"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-wolverhamptoncombined"
      + records             = [
          + "10.2.63.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-wolverhamptoncombined-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-wolverhamptoncombined-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-wolverhamptonmags"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-wolverhamptonmags"
      + records             = [
          + "10.232.80.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-wolverhamptonmags-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-wolverhamptonmags-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-woodgreen"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-woodgreen"
      + records             = [
          + "10.1.91.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-woodgreen-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-woodgreen-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-woolwich"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-woolwich"
      + records             = [
          + "10.1.93.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-woolwich-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-woolwich-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-worcester"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-worcester"
      + records             = [
          + "10.2.64.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-worcester-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-worcester-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-york"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-york"
      + records             = [
          + "10.6.37.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_a_record.this["xhb-pubd-york-stg"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "xhb-pubd-york-stg"
      + records             = [
          + "10.225.251.135",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.hmcts-net.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

Plan: 258 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":586,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->